using System.Collections.Generic;
using TimeTableKGU.Models;
namespace TimeTableKGU.Data
{
    public class TimeTableData
    {
        public static List<TimeTable> TimeTables;
        static TimeTableData()
        {
            TimeTables = new List<TimeTable>();
            TimeTables.Add(new TimeTable("Понедельник", "13.20-14.50", "Основы теории нейронных сетей(лек.)", "Добрица В.П.", 0, "ССЫЛКА", "Числитель"));
            TimeTables.Add(new TimeTable("Понедельник", "15.00-16.30", "Технология разработки программного обеспечения(лаб.)", "Ураева Е.Е.", 0, "ССЫЛКА", "Числитель"));
            TimeTables.Add(new TimeTable( "Вторник", "13.20-14.50", "Интернет-коммуникация на иностранном языке(пр.)", "Бурак М.А.", 0, "ССЫЛКА", "Числитель"));
            TimeTables.Add(new TimeTable( "Вторник", "15.00-16.30", "Основы теории нейронных сетей(лаб.)", "Добрица В.П.", 0, "ССЫЛКА", "Числитель"));
            TimeTables.Add(new TimeTable( "Среда", "13.20-14.50", "Зашита информации в компьютерных системах и сетях(лек.)", "Крыжевич Л.С.", 208, "", "Числитель"));
            TimeTables.Add(new TimeTable("Среда", "15.00-16.30", "Зашита информации в компьютерных системах и сетях(лаб.)", "Крыжевич Л.С.", 199, "", "Числитель"));
            TimeTables.Add(new TimeTable( "Среда", "16.40-18.10", "Эксплотация информационных систем и баз данных(лек.)", "Макаров К.С.", 209, "", "Числитель"));
            TimeTables.Add(new TimeTable("Четверг", "15.00-16.30", "Java-технологии(лек.)", "Белова Т.В.", 0, "ССЫЛКА", "Числитель"));
            TimeTables.Add(new TimeTable( "Четверг", "16.40-18.10", "Java-технологии(лаб.)", "Белова Т.В.", 0, "ССЫЛКА", "Числитель"));
            TimeTables.Add(new TimeTable( "Пятница", "13.20-14.50", "Технология разработки программного обеспечения(лаб.)", "Ураева Е.Е.", 198, "", "Числитель"));
            TimeTables.Add(new TimeTable( "Пятница", "15.00-16.30", "Технология разработки программного обеспечения(лек.)", "Ураева Е.Е.", 208, "", "Числитель"));
            TimeTables.Add(new TimeTable( "Пятница", "16.40-18.10", "Эксплотация информационных систем и баз данных(лаб.)", "Макаров К.С.", 203, "", "Числитель"));
            TimeTables.Add(new TimeTable( "Суббота", "08.00-09.30", "Администрирование 1С(лаб.)", "Чистилина Е.В.", 0, "ССЫЛКА", "Числитель"));
            TimeTables.Add(new TimeTable( "Суббота", "09.40-11.10", "Администрирование 1С(лек.)", "Чистилина Е.В.", 0, "ССЫЛКА", "Числитель"));
            TimeTables.Add(new TimeTable( "Суббота", "11.20-12.50", "Эксплотация информационных систем и баз данных(лаб.)", "Макаров К.С.", 0, "ССЫЛКА", "Числитель"));

            TimeTables.Add(new TimeTable( "Понедельник", "13.20-14.50", "Основы теории нейронных сетей(лек.)", "Добрица В.П.", 0, "ССЫЛКА", "Знаменатель"));
            TimeTables.Add(new TimeTable( "Понедельник", "15.00-16.30", "Технология разработки программного обеспечения(лаб.)", "Ураева Е.Е.", 0, "ССЫЛКА", "Знаменатель"));
            TimeTables.Add(new TimeTable( "Вторник", "13.20-14.50", "Интернет-коммуникация на иностранном языке(пр.)", "Добрица В.П.", 0, "ССЫЛКА", "Знаменатель"));
            TimeTables.Add(new TimeTable( "Вторник", "15.00-16.30", "Основы теории нейронных сетей(лаб.)", "Добрица В.П.", 0, "ССЫЛКА", "Знаменатель"));
            TimeTables.Add(new TimeTable( "Среда", "13.20-14.50", "Зашита информации в компьютерных системах и сетях(лек.)", "Крыжевич Л.С.", 208, "", "Знаменатель"));
            TimeTables.Add(new TimeTable( "Среда", "15.00-16.30", "Зашита информации в компьютерных системах и сетях(лаб.)", "Крыжевич Л.С.", 199, "", "Знаменатель"));
            TimeTables.Add(new TimeTable( "Среда", "16.40-18.10", "Эксплотация информационных систем и баз данных(лек.)", "Макаров К.С.", 209, "", "Знаменатель"));
            TimeTables.Add(new TimeTable( "Четверг", "15.00-16.30", "Java-технологии(лек.)", "Белова Т.В.", 0, "ССЫЛКА", "Знаменатель"));
            TimeTables.Add(new TimeTable( "Четверг", "16.40-18.10", "Java-технологии(лаб.)", "Белова Т.В.", 0, "ССЫЛКА", "Знаменатель"));
            TimeTables.Add(new TimeTable( "Пятница", "13.20-14.50", "Эксплотация информационных систем и баз данных(лаб.)", "Макаров К.С.", 203, "", "Знаменатель"));
            TimeTables.Add(new TimeTable( "Пятница", "15.00-16.30", "Технология разработки программного обеспечения(лек.)", "Ураева Е.Е.", 208, "", "Знаменатель"));
            TimeTables.Add(new TimeTable( "Пятница", "16.40-18.10", "Эксплотация информационных систем и баз данных(лаб.)", "Макаров К.С.", 203, "", "Знаменатель"));
            TimeTables.Add(new TimeTable( "Суббота", "08.00-09.30", "Администрирование 1С(лаб.)", "Чистилина Е.В.", 0, "ССЫЛКА", "Знаменатель"));
            TimeTables.Add(new TimeTable( "Суббота", "09.40-11.10", "Администрирование 1С(лек.)", "Чистилина Е.В.", 0, "ССЫЛКА", "Знаменатель"));
            TimeTables.Add(new TimeTable( "Суббота", "11.20-12.50", "Администрирование 1С(лаб.)", "Чистилина Е.В.", 0, "ССЫЛКА", "Знаменатель"));
        }
    }
}
